// ============================================================================
// 
// ちょちょいとファイル合併 2 の設定を管理
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CFileMerge2.Models.SharedMisc;

internal class Cfm2Settings
{
    // ====================================================================
    // コンストラクター
    // ====================================================================

    // --------------------------------------------------------------------
    // メインコンストラクター
    // EnvironmentModel 構築時に呼びだされるため、LogWriter は指定できない
    // --------------------------------------------------------------------
    public Cfm2Settings()
    {
    }

    // ====================================================================
    // public プロパティー
    // ====================================================================

    // --------------------------------------------------------------------
    // 設定
    // --------------------------------------------------------------------

    // --------------------------------------------------------------------
    // 終了時の状態（ちょちょいとファイル合併 2 専用）
    // --------------------------------------------------------------------

    /// <summary>
    /// メイクファイルのパス
    /// </summary>
    public String MakePath
    {
        get;
        set;
    } = String.Empty;

    // --------------------------------------------------------------------
    // 終了時の状態（一般）
    // --------------------------------------------------------------------

    // 前回起動時の世代
    public String PrevLaunchGeneration { get; set; } = String.Empty;

    // 前回起動時のバージョン
    public String PrevLaunchVer { get; set; } = String.Empty;

    // 前回起動時のパス
    public String PrevLaunchPath { get; set; } = String.Empty;

    // RSS 確認日
    public DateTime RssCheckDate
    {
        get; set;
    }

}
