// ============================================================================
// 
// Cfm タグの情報
// 
// ============================================================================

// ----------------------------------------------------------------------------
// <!-- Cfm/Key: Value -->
// ----------------------------------------------------------------------------

namespace CFileMerge2.Models.SharedMisc;

internal class CfmTagInfo
{
    /// <summary>
    /// キー
    /// </summary>
    public TagKey Key
    {
        get;
        set;
    }

    /// <summary>
    /// 値
    /// </summary>
    public String Value
    {
        get;
        set;
    } = String.Empty;
}
