// ============================================================================
// 
// 設定保存に関するオプション？
// 
// ============================================================================

// ----------------------------------------------------------------------------
// MSIX パッケージの際は使用されない模様
// ----------------------------------------------------------------------------

namespace CFileMerge2.Models.SharedMisc;

public class LocalSettingsOptions
{
    public string? ApplicationDataFolder
    {
        get; set;
    }

    public string? LocalSettingsFile
    {
        get; set;
    }
}
