// ============================================================================
// 
// 合併作業用の情報
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CFileMerge2.Models.SharedMisc;
internal class MergeInfo
{
    // ====================================================================
    // public プロパティー
    // ====================================================================

    // 合併後の内容
    public LinkedList<String> Lines
    {
        get;
    } = new();

}
