// ============================================================================
// 
// バージョン情報ページのコードビハインド
// 
// ============================================================================

// ----------------------------------------------------------------------------
//  
// ----------------------------------------------------------------------------

using CFileMerge2.ViewModels.AboutWindows;

namespace CFileMerge2.Views.AboutWindows;

public sealed partial class AboutPage : PageEx3
{
    // ====================================================================
    // コンストラクター
    // ====================================================================

    /// <summary>
    /// メインコンストラクター
    /// </summary>
    public AboutPage(WindowEx3 window)
            : base(window)
    {
        ViewModel = new AboutPageViewModel(window);
        InitializeComponent();
    }

    // ====================================================================
    // public プロパティー
    // ====================================================================

    /// <summary>
    /// ビューモデル
    /// </summary>
    public AboutPageViewModel ViewModel
    {
        get;
    }
}
